In [1]:
import pandas as pd

In [43]:
event = pd.read_csv('events2016_subset_end.csv')

In [99]:
bike = pd.read_csv('CB2016_subset_1km.csv')

In [100]:
len(event),len(bike)

(134, 100666)

In [101]:
bike.head(1)

,Unnamed: 0,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender,startdate,stopdate
0,0,173,16:03:10,16:06:03,243,Fulton St & Rockwell Pl,40.688226,-73.979382,241,DeKalb Ave & S Portland Ave,40.68981,-73.974931,23976,Subscriber,1971.0,2,2016-01-01,2016-01-01

In [102]:
event.head(1)

,Unnamed: 0,Unnamed: 0.1,EventID,Event_type,Name,Start_Time,Start_Hour,End_Time,End_Hour,weekday,Date,S_Time
0,1,168,1490000000000000,basketball,Harlem Globetrotters,2016-01-02 19:00:00,19,2016-01-02 21:00:00,21,False,2016-01-02,19:00:00

In [103]:
event['Date'] = pd.to_datetime(event['Start_Time']).dt.date

In [104]:
event['S_Time'] = pd.to_datetime(event['Start_Time']).dt.time

In [105]:
event.head(1)

,Unnamed: 0,Unnamed: 0.1,EventID,Event_type,Name,Start_Time,Start_Hour,End_Time,End_Hour,weekday,Date,S_Time
0,1,168,1490000000000000,basketball,Harlem Globetrotters,2016-01-02 19:00:00,19,2016-01-02 21:00:00,21,False,2016-01-02,19:00:00

In [106]:
e = event[['Date','Event_type']]

In [107]:
e.Date = pd.to_datetime(e.Date)
bike.startdate = pd.to_datetime(bike.startdate)

In [108]:
joined = bike.merge(e,left_on='startdate',right_on='Date',how='left')

In [109]:
len(bike),len(joined)

(100666, 100666)

In [110]:
joined.head(1)

,Unnamed: 0,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender,startdate,stopdate,Date,Event_type
0,0,173,16:03:10,16:06:03,243,Fulton St & Rockwell Pl,40.688226,-73.979382,241,DeKalb Ave & S Portland Ave,40.68981,-73.974931,23976,Subscriber,1971.0,2,2016-01-01,2016-01-01,NaT,NaN

In [111]:
joined.keys()

Index([u'Unnamed: 0', u'tripduration', u'starttime', u'stoptime',
       u'start station id', u'start station name', u'start station latitude',
       u'start station longitude', u'end station id', u'end station name',
       u'end station latitude', u'end station longitude', u'bikeid',
       u'usertype', u'birth year', u'gender', u'startdate', u'stopdate',
       u'Date', u'Event_type'],
      dtype='object')

In [112]:
joined.drop([u'Unnamed: 0', 
       u'Date'],axis=1,inplace=True)

In [113]:
joined.head(1)

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender,startdate,stopdate,Event_type
0,173,16:03:10,16:06:03,243,Fulton St & Rockwell Pl,40.688226,-73.979382,241,DeKalb Ave & S Portland Ave,40.68981,-73.974931,23976,Subscriber,1971.0,2,2016-01-01,2016-01-01,NaN

In [114]:
joined.to_csv('JoinedEvent_CB2016_subset_1km.csv')